// /** @file
// This module produces EFI IPv4 Configuration Protocol.
//
// This module produces EFI IPv4 Configuration Protocol upon EFI MNP Protocol,
// to performs platform- and policy-dependent configuration for the EFI IPv4
// Protocol driver. It installs EFI HII Configuration Access Protocol to provide
// one way to configurate the IPv4 network setting.
//
// Copyright (c) 2006 - 2014, Intel Corporation. All rights reserved.<BR>
//
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution. The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
// 
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// **/


#string STR_MODULE_ABSTRACT             #language en-US "Produces EFI IPv4 Configuration Protocol"

#string STR_MODULE_DESCRIPTION          #language en-US "This module produces EFI IPv4 Configuration Protocol upon EFI MNP Protocol, to performs platform-dependent and policy-dependent configuration for the EFI IPv4 Protocol driver. It installs the EFI HII Configuration Access Protocol to provide a way to configure the IPv4 network setting."

